#Токен бота
TOKEN = ''

#Данные для составления заявки (не трогать)
message_admin = {
    'phone': '',
    'name': '',
    'mesto': '',
    'id_pearson': '',
    's_trenerom_and_sam': '',
    'time': '',
    'pos': '',
    'sv': '',
    'fit_prog': '',
    'time_tren': '',
    'tren_name': '',
    'data for communication': ''
}

#Цены

#Трен-зал
#Cамостоятельно, Не решил
tzs = ('3300', '2600', '2300', '2100', '1800', '2900')

#С тренером
tzs_tren = ('4500', '3600', '2300')

#Фит-прог
#Фит-вечер
fpfv = ('3300', '2900', '2700', '2300', '1800', '2600', '2100')

#Фит-утро Растяжка Йога
fpfusy = ('3300', '2900', '2700', '2300', '1800', '2600', '2100')

#Йога спецкласс
fpysk = ('650')

#Умное-тело
fpsb = ('3300', '2900', '2700', '2300', '1800', '2600', '2100', '2400')

